In [1]:
import pandas as pd

In [2]:
import numpy as np

In [4]:
dataframe = pd.read_csv("fruit delete after.csv")

In [5]:
dataframe

        Fruit  Cost
0      Banana  4.00
1  Strawberry  0.75
2  Blackberry  0.50
3       Apple  1.25

In [6]:
dataframe["Greater Than a Dollar"] = ""

In [8]:
for index, row in dataframe.iterrows():
    if row['Cost'] <= 1:
        dataframe.loc[index,'Greater Than a Dollar'] = 'FALSE'
    if row['Cost'] > 1:
        dataframe.loc[index,'Greater Than a Dollar'] = 'TRUE'

In [9]:
dataframe

        Fruit  Cost Greater Than a Dollar
0      Banana  4.00                  TRUE
1  Strawberry  0.75                 FALSE
2  Blackberry  0.50                 FALSE
3       Apple  1.25                  TRUE